app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello World!"], ["user_id", 2], ["created_at", "2016-02-17 00:01:21.175752"], ["updated_at", "2016-02-17 00:01:21.175752"]]
---
   def create
       @post = Post.new(post_parms)
       @post.user_id = current_user.id #assign the post to the user that created it
       respond_to do |f|
           if(@post.save)